; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 115986 2 1 3 3 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image2 - mode
	spectrograph0 - mode
	thermograph1 - mode
	Star0 - direction
	Star2 - direction
	GroundStation1 - direction
	Phenomenon3 - direction
	Star4 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph0)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(pointing satellite1 GroundStation1)
	(have_image Phenomenon3 image2)
	(have_image Star4 spectrograph0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 3
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
3. (turn_to satellite1 phenomenon3 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon3)
   goals met: 0 of 3
4. (turn_to satellite0 groundstation1 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 3
5. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 3
6. (turn_to satellite1 groundstation1 phenomenon3)
   deleted: (pointing satellite1 phenomenon3)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 3
7. (turn_to satellite0 star4 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star4)
   goals met: 1 of 3
8. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 1 of 3
9. (take_image satellite0 star4 instrument0 spectrograph0)
   added: (have_image star4 spectrograph0)
   goals met: 2 of 3
10. (turn_to satellite1 phenomenon3 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon3)
   goals met: 1 of 3
11. (take_image satellite1 phenomenon3 instrument1 image2)
   added: (have_image phenomenon3 image2)
   goals met: 2 of 3
12. (turn_to satellite1 groundstation1 phenomenon3)
   deleted: (pointing satellite1 phenomenon3)
   added: (pointing satellite1 groundstation1)
   goals met: 3 of 3
